---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.GridCenterSegmentPattern
source: html/270b88fb-8e03-4edb-108b-fd71d28cbdea.htm
---
# Autodesk.Revit.DB.ParameterTypeId.GridCenterSegmentPattern Property

"Center Segment Pattern"

## Syntax (C#)
```csharp
public static ForgeTypeId GridCenterSegmentPattern { get; }
```